commands_templates/ContinuousMove0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver20/ptz/wsdl" xmlns:sch="http://www.onvif.org/ver10/schema">
   <soap:Header/>
   <soap:Body>
      <wsdl:ContinuousMove>
         <!--type: ReferenceToken-->
         <wsdl:ProfileToken>?</wsdl:ProfileToken>
         <wsdl:Velocity>
            <!--Optional:-->
            <sch:PanTilt x="?" y="?" space="?"/>
            <!--Optional:-->
            <sch:Zoom x="?" space="?"/>
         </wsdl:Velocity>
         <!--Optional:-->
         <!--type: duration-->
         <wsdl:Timeout>?</wsdl:Timeout>
      </wsdl:ContinuousMove>
   </soap:Body>
</soap:Envelope>